In [3]:
import numpy as np, pandas as pd

In [47]:
# DataFrameの作成
df = pd.DataFrame(np.arange(2,14,2).reshape(2,3),
    columns=['A','B','C'])
# nparange(start,stop,step)

In [49]:
df

   A   B   C
0  2   4   6
1  8  10  12

In [48]:
pd.DataFrame({'A':[2,8],'B':[4,10],'C':[6,12]})

   A   B   C
0  2   4   6
1  8  10  12

In [4]:
pd.Series([1,2,3],dtype=float)

0    1.0
1    2.0
2    3.0
dtype: float64

In [5]:
df['Var']=None

NameError: name 'df' is not defined

In [6]:
# ブロードキャスト
# シェイプが異なる多次元配列同士の演算を可能にする仕組み

In [7]:
df = pd.DataFrame(np.arange(2,8).reshape(2,3))

In [8]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [9]:
df//2

   0  1  2
0  1  1  2
1  2  3  3

In [10]:
df + [2,1,0]

   0  1  2
0  4  4  4
1  7  7  7

In [11]:
(df.T +[3,0]).T

   0  1  2
0  5  6  7
1  5  6  7

In [16]:
# 条件抽出
df = pd.DataFrame(np.arange(8).reshape(4,2),
                  columns=['A','B'])

In [17]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7

In [18]:
i,j=2,5

In [19]:
df[(df.A==i)|(df.B==j)]

   A  B
1  2  3
2  4  5

In [20]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7

In [21]:
df.A

0    0
1    2
2    4
3    6
Name: A, dtype: int64

In [22]:
df.query('A==@i or B==@j')

   A  B
1  2  3
2  4  5

In [23]:
# ユニバーサル関数
# DataFrameを引数にとって、要素ごとに演算し、元のDataFrameと同じシェイプで返す関数

In [25]:
df= pd.DataFrame(np.arange(2,8).reshape(2,3))

In [26]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [27]:
np.less(df,5)

       0      1      2
0   True   True   True
1  False  False  False

In [28]:
df.apply(lambda v:v<5)

       0      1      2
0   True   True   True
1  False  False  False

In [29]:
# 軸で演算する関数

In [33]:
df = pd.DataFrame(np.arange(2,8).reshape(2,3))

In [34]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [38]:
df.max(axis=0)

0    5
1    6
2    7
dtype: int64

In [39]:
df.max(axis=1)

0    4
1    7
dtype: int64

In [43]:
# argmax関数　最大値のインデックスを求める
print(df.values.argmax())

5

In [41]:
print(df.values.argmax(0))

[1 1 1]

In [42]:
print(df.values.argmax(1))

[2 2]

In [44]:
# その他の関数

In [45]:
# gurobiby関数　指定した列の値が同じ行をグルーピングする

In [50]:
df = pd.DataFrame([[1,3],[1,5],[2,7]],columns=['A','B'])
df

   A  B
0  1  3
1  1  5
2  2  7

In [54]:
for key, group in df.groupby('A'):
    print(f'{key}:\n{group}\n')

1:
   A  B
0  1  3
1  1  5

2:
   A  B
2  2  7

In [56]:
df.groupby('A').first()

   B
A
1  3
2  7

In [58]:
df.groupby('A').mean() # 3と5の平均

   B
A
1  4
2  7

In [59]:
# merge関数　2つの表を結合する

In [66]:
df = pd.DataFrame({'I': [1,1,2,2,3,3],
                   'J': [2,3,1,3,1,2],
                   'Var':'U V W X Y Z'.split()})

In [67]:
df

   I  J Var
0  1  2   U
1  1  3   V
2  2  1   W
3  2  3   X
4  3  1   Y
5  3  2   Z

In [68]:
pd.merge(df,pd.DataFrame(
    {'I': df.J, 'J':df.I, 'Other': df.Var}))

   I  J Var Other
0  1  2   U     W
1  1  3   V     Y
2  2  1   W     U
3  2  3   X     Z
4  3  1   Y     V
5  3  2   Z     X

In [69]:
# itertuples関数　表ごとに繰り返す

In [72]:
df = pd.DataFrame(np.arange(2,8).reshape(2,3))

In [73]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [74]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, _1=2, _2=3, _3=4)
Pandas(Index=1, _1=5, _2=6, _3=7)

In [75]:
# get_dummies関数　One hotベクトル化する
# One hotベクトル：要素ごとに出現するかどうか

In [77]:
df = pd.DataFrame([['Alice','F'],['Bob','M'],['Dave','M']],columns=['Name','Type'])

In [78]:
df

    Name Type
0  Alice    F
1    Bob    M
2   Dave    M

In [79]:
pd.get_dummies(df,columns=['Type'])

    Name  Type_F  Type_M
0  Alice       1       0
1    Bob       0       1
2   Dave       0       1

In [80]:
# pivot関数　ピボットテーブルを作成する

In [81]:
df = pd.DataFrame({
    '時限':[1,1,1,2,2,2],
    '曜日':'月 火 水 月 火 水'.split(),
    '科目':'国　算　社　理　音　体'.split(),
})

In [83]:
df

   時限 曜日 科目
0   1  月  国
1   1  火  算
2   1  水  社
3   2  月  理
4   2  火  音
5   2  水  体

In [84]:
df.pivot('時限','曜日')

   科目
曜日  月  水  火
時限
1   国  社  算
2   理  体  音

In [86]:
df.pivot('時限','科目')

     曜日
科目    体    国    理    社    算    音
時限
1   NaN    月  NaN    水    火  NaN
2     水  NaN    月  NaN  NaN    火